# Финальное задание
## *1. Создать репозиторий на GitHub*
## *2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)*
## *3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)*
## *4. Написать программу, решающую поставленную задачу*
## *5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)*

# Задача

*Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.*

# Решение

    def fltr (animals, lenght= 3):
    result = []

    for animal in animals:
        if len(animal) <= lenght:
            result.append(animal)

    return result


    animals = ['Cat', 'Wolf', 'Elephant', 'Lion', 'Dog', 'Rabbit', 'Lizard', 'Bear']
    result = fltr(animals)

    print(f'Original list:\n'
      f'{animals}.\n\n'
      f'Filtered list:\n'
      f'{result}.')